Revit 2027 API
AssetProperty.IsEditable Method
 Check if property can be edited.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEditable()
Public Function IsEditable As Boolean
public:
bool IsEditable()
member IsEditable : unit -> bool
Return Value
Boolean
 True if property is editable.
Exceptions
Exception | Condition
InvalidOperationException |  The asset property is not editable. Asset can be edited only in an edit scope.
Remarks
 Properties can be edited only if there is an active Edit Scope and if the property is allowed to be changed.
See Also
Reference
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace